{
    "subreddits": [
        {
            "name": "amitheasshole",
            "description": "Am I The Asshole"
        },
        {
            "name": "entitledpeople",
            "description": "Entitled People"
        },
        {
            "name": "relationships",
            "description": "A community to discuss and get advice on relationships."
        },
        {
            "name": "Relationship_Advice",
            "description": "Need help with your relationship? Whether it's romance, friendship, family, co-workers, or basic human interaction: we're here to help!"
        },
        {
            "name": "tifu",
            "description": "Today I Fucked Up is a community for sharing personal stories of mistakes."
        },
        {
            "name": "nosleep",
            "description": "A place for horror stories and fictional tales that will keep you awake."
        },
        {
            "name": "prorevenge",
            "description": "A subreddit for sharing stories of epic revenge."
        },
        {
            "name": "MaliciousCompliance",
            "description": "Stories about people following instructions to the letter but in unexpected ways."
        },
        {
            "name": "entitledparents",
            "description": "Stories of parents who believe their children are entitled to everything."
        },
        {
            "name": "Jokes",
            "description": "A place for sharing jokes and funny anecdotes."
        },
        {
            "name": "TalesFromRetail",
            "description": "Stories from people who work in retail."
        },
        {
            "name": "TrueOffMyChest",
            "description": "TrueOffMyChest, a place for people who need to speak their mind"
        },
        {
            "name": "JUSTNOMIL",
            "description": "A place to post about your MIL or Mother who is just the *worst*. Come for support, come for advice, or just to vent and get it all out."
        },
        {
            "name": "IDontWorkHereLady",
            "description": "derivative of subreddits like Tales From Retail that involves stories about folks that go into other businesses and have irate customers mistake them for employees."
        },
        {
            "name": "confessions",
            "description": "Get that nasty secret off your chest or simply use this as a place to vent. See the unfiltered opinions of strangers."
        }
    ]
}